# Author:wuhuaisj
# Date:2021/4/15 9:04
# Github:https://github.com/chuwuhua

import geopandas
import os

data_root = os.path.abspath(os.path.join(os.getcwd(), "../.."))
data_path = os.path.join(data_root, '原始数据', '全国省市县行政区划界线', '县.shp')

shp_df = geopandas.GeoDataFrame.from_file(data_path, encoding='utf-8')
# cs = shp_df.loc[shp_df['NAME'].isin(['天心区','芙蓉区','开福区' ,'雨花区','望城区','岳麓区'])]
cs = shp_df.loc[shp_df['NAME'].isin(['芙蓉区'])]
print(cs.bounds)

'''
长沙市范围
          minx       miny        maxx       maxy
185  111.890866  27.851024  114.256514  28.664368

一区范围 芙蓉区
minx      miny        maxx       maxy
1592  112.970419  28.17616  113.103032  28.227567

四区范围
        minx       miny        maxx       maxy
1592  112.970419  28.176160  113.103032  28.227567
1593  112.923054  27.969243  113.032882  28.199103
1595  112.903165  28.198718  113.078946  28.392893
1596  112.978385  27.914597  113.182139  28.193431

      112.903165  27.914597  113.182139  28.392893
六区范围      
            minx       miny        maxx       maxy
1592  112.970419  28.176160  113.103032  28.227567
1593  112.923054  27.969243  113.032882  28.199103
1594  112.606134  27.976473  112.966471  28.277273
1595  112.903165  28.198718  113.078946  28.392893
1596  112.978385  27.914597  113.182139  28.193431
1597  112.645644  28.142046  113.041418  28.561062
      112.606134  27.914597  113.182139  28.561062
'''
